STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_cm33.h
/**
  * @brief Ethernet MAC
  */
typedef struct
{
  __IO uint32_t MACCR;                                /*!< Operating mode configuration register                      Address offset: 0x0000 */
  __IO uint32_t MACECR;                               /*!< Extended operating mode configuration register             Address offset: 0x0004 */
  __IO uint32_t MACPFR;                               /*!< Packet filtering control register                          Address offset: 0x0008 */
  __IO uint32_t MACWJBTR;                             /*!< Watchdog and jabber timeout register                       Address offset: 0x000C */
  __IO uint32_t MACHT0R;                              /*!< Hash Table 0 register                                      Address offset: 0x0010 */
  __IO uint32_t MACHT1R;                              /*!< Hash Table 1 register                                      Address offset: 0x0014 */
       uint32_t RESERVED0[14];                        /*!< Reserved                                                   Address offset: 0x0018-0x004C */
  __IO uint32_t MACVTCR;                              /*!< VLAN tag Control register                                  Address offset: 0x0050 */
  __IO uint32_t MACVTDR;                              /*!< VLAN tag data register                                     Address offset: 0x0054 */
  __IO uint32_t MACVHTR;                              /*!< VLAN Hash table register                                   Address offset: 0x0058 */
       uint32_t RESERVED1;                            /*!< Reserved                                                   Address offset: 0x005C */
  __IO uint32_t MACVIR;                               /*!< VLAN inclusion register                                    Address offset: 0x0060 */
  __IO uint32_t MACIVIR;                              /*!< Inner VLAN inclusion register                              Address offset: 0x0064 */
       uint32_t RESERVED2[2];                         /*!< Reserved                                                   Address offset: 0x0068-0x006C */
  __IO uint32_t MACQ0TXFCR;                           /*!< Tx Queue 0 flow control register                           Address offset: 0x0070 */
       uint32_t RESERVED3[7];                         /*!< Reserved                                                   Address offset: 0x0074-0x008C */
  __IO uint32_t MACRXFCR;                             /*!< Rx flow control register                                   Address offset: 0x0090 */
  __IO uint32_t MACRXQCR;                             /*!< Rx Queue control register                                  Address offset: 0x0094 */
       uint32_t RESERVED4[2];                         /*!< Reserved                                                   Address offset: 0x0098-0x009C */
  __IO uint32_t MACRXQC0R;                            /*!< Rx queue control 0 register                                Address offset: 0x00A0 */
  __IO uint32_t MACRXQC1R;                            /*!< Rx queue control 1 register                                Address offset: 0x00A4 */
  __IO uint32_t MACRXQC2R;                            /*!< Rx queue control 2 register                                Address offset: 0x00A8 */
       uint32_t RESERVED5;                            /*!< Reserved                                                   Address offset: 0x00AC */
  __IO uint32_t MACISR;                               /*!< Interrupt status register                                  Address offset: 0x00B0 */
  __IO uint32_t MACIER;                               /*!< Interrupt enable register                                  Address offset: 0x00B4 */
  __IO uint32_t MACRXTXSR;                            /*!< Rx Tx status register                                      Address offset: 0x00B8 */
       uint32_t RESERVED6;                            /*!< Reserved                                                   Address offset: 0x00BC */
  __IO uint32_t MACPCSR;                              /*!< PMT control status register                                Address offset: 0x00C0 */
  __IO uint32_t MACRWKPFR;                            /*!< Remote wake-up packet filter register                      Address offset: 0x00C4 */
       uint32_t RESERVED7[2];                         /*!< Reserved                                                   Address offset: 0x00C8-0x00CC */
  __IO uint32_t MACLCSR;                              /*!< LPI control and status register                            Address offset: 0x00D0 */
  __IO uint32_t MACLTCR;                              /*!< LPI timers control register                                Address offset: 0x00D4 */
  __IO uint32_t MACLETR;                              /*!< LPI entry timer register                                   Address offset: 0x00D8 */
  __IO uint32_t MAC1USTCR;                            /*!< One-microsecond-tick counter register                      Address offset: 0x00DC */
       uint32_t RESERVED8[6];                         /*!< Reserved                                                   Address offset: 0x00E0-0x00F4 */
  __IO uint32_t MACPHYCSR;                            /*!< PHYIF control status register                              Address offset: 0x00F8 */
       uint32_t RESERVED9[5];                         /*!< Reserved                                                   Address offset: 0x00FC-0x010C */
  __IO uint32_t MACVR;                                /*!< Version register                                           Address offset: 0x0110 */
  __IO uint32_t MACDR;                                /*!< Debug register                                             Address offset: 0x0114 */
       uint32_t RESERVED10;                           /*!< Reserved                                                   Address offset: 0x0118 */
  __IO uint32_t MACHWF0R;                             /*!< HW feature 0 register                                      Address offset: 0x011C */
  __IO uint32_t MACHWF1R;                             /*!< HW feature 1 register                                      Address offset: 0x0120 */
  __IO uint32_t MACHWF2R;                             /*!< HW feature 2 register                                      Address offset: 0x0124 */
  __IO uint32_t MACHWF3R;                             /*!< HW feature 3 register                                      Address offset: 0x0128 */
       uint32_t RESERVED11[53];                       /*!< Reserved                                                   Address offset: 0x012C-0x01FC */
  __IO uint32_t MACMDIOAR;                            /*!< MDIO address register                                      Address offset: 0x0200 */
  __IO uint32_t MACMDIODR;                            /*!< MDIO data register                                         Address offset: 0x0204 */
       uint32_t RESERVED12[2];                        /*!< Reserved                                                   Address offset: 0x0208-0x020C */
  __IO uint32_t MACARPAR;                             /*!< ARP address register                                       Address offset: 0x0210 */
       uint32_t RESERVED13[7];                        /*!< Reserved                                                   Address offset: 0x0214-0x022C */
  __IO uint32_t MACCSRSWCR;                           /*!< CSR software control register                              Address offset: 0x0230 */
  __IO uint32_t MACFPECSR;                            /*!< FPE control and status register                            Address offset: 0x0234 */
       uint32_t RESERVED14[2];                        /*!< Reserved                                                   Address offset: 0x0238-0x023C */
  __IO uint32_t MACPRSTIMR;                           /*!< MAC presentation time register                             Address offset: 0x0240 */
  __IO uint32_t MACPRSTIMUR;                          /*!< MAC presentation time update register                      Address offset: 0x0244 */
       uint32_t RESERVED15[46];                       /*!< Reserved                                                   Address offset: 0x0248-0x02FC */
  __IO uint32_t MACA0HR;                              /*!< MAC Address 0 high register                                Address offset: 0x0300 */
  __IO uint32_t MACA0LR;                              /*!< MAC Address 0 low register                                 Address offset: 0x0304 */
  __IO uint32_t MACA1HR;                              /*!< MAC Address 1 high register                                Address offset: 0x0308 */
  __IO uint32_t MACA1LR;                              /*!< MAC Address 1 low register                                 Address offset: 0x030C */
  __IO uint32_t MACA2HR;                              /*!< MAC Address 2 high register                                Address offset: 0x0310 */
  __IO uint32_t MACA2LR;                              /*!< MAC Address 2 low register                                 Address offset: 0x0314 */
  __IO uint32_t MACA3HR;                              /*!< MAC Address 3 high register                                Address offset: 0x0318 */
  __IO uint32_t MACA3LR;                              /*!< MAC Address 3 low register                                 Address offset: 0x031C */
       uint32_t RESERVED16[248];                      /*!< Reserved                                                   Address offset: 0x0320-0x06FC */
  __IO uint32_t MMC_CONTROL;                          /*!< MMC control register                                       Address offset: 0x0700 */
  __IO uint32_t MMC_RX_INTERRUPT;                     /*!< MMC Rx interrupt register                                  Address offset: 0x0704 */
  __IO uint32_t MMC_TX_INTERRUPT;                     /*!< MMC Tx interrupt register                                  Address offset: 0x0708 */
  __IO uint32_t MMC_RX_INTERRUPT_MASK;                /*!< MMC Rx interrupt mask register                             Address offset: 0x070C */
  __IO uint32_t MMC_TX_INTERRUPT_MASK;                /*!< MMC Tx interrupt mask register                             Address offset: 0x0710 */
  __IO uint32_t TX_OCTET_COUNT_GOOD_BAD;              /*!< Tx octet count good bad register                           Address offset: 0x0714 */
  __IO uint32_t TX_PACKET_COUNT_GOOD_BAD;             /*!< Tx packet count good bad register                          Address offset: 0x0718 */
  __IO uint32_t TX_BROADCAST_PACKETS_GOOD;            /*!< Tx broadcast packets good register                         Address offset: 0x071C */
  __IO uint32_t TX_MULTICAST_PACKETS_GOOD;            /*!< Tx multicast packets good register                         Address offset: 0x0720 */
  __IO uint32_t TX_64OCTETS_PACKETS_GOOD_BAD;         /*!< Tx 64 octets packets good bad register                     Address offset: 0x0724 */
  __IO uint32_t TX_64TO127OCTETS_PACKETS_GOOD_BAD;    /*!< Tx 65 to 127 octets packets good bad register              Address offset: 0x0728 */
  __IO uint32_t TX_128TO255OCTETS_PACKETS_GOOD_BAD;   /*!< Tx 128 to 255 octets packets good bad register             Address offset: 0x072C */
  __IO uint32_t TX_256TO511OCTETS_PACKETS_GOOD_BAD;   /*!< Tx 256 to 511 octets packets good bad register             Address offset: 0x0730 */
  __IO uint32_t TX_512TO1023OCTETS_PACKETS_GOOD_BAD;  /*!< Tx 512 to 1023 octets packets good bad register            Address offset: 0x0734 */
  __IO uint32_t TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD;  /*!< Tx 1024 to max octets packets good bad register            Address offset: 0x0738 */
  __IO uint32_t TX_UNICAST_PACKETS_GOOD_BAD;          /*!< Tx unicast packets good bad register                       Address offset: 0x073C */
  __IO uint32_t TX_MULTICAST_PACKETS_GOOD_BAD;        /*!< Tx multicast packets good bad register                     Address offset: 0x0740 */
  __IO uint32_t TX_BROADCAST_PACKETS_GOOD_BAD;        /*!< Tx broadcast packets good bad register                     Address offset: 0x0744 */
  __IO uint32_t TX_UNDERFLOW_ERROR_PACKETS;           /*!< Tx underflow error packets register                        Address offset: 0x0748 */
  __IO uint32_t TX_SINGLE_COLLISION_GOOD_PACKETS;     /*!< Tx single collision good packets register                  Address offset: 0x074C */
  __IO uint32_t TX_MULTIPLE_COLLISION_GOOD_PACKETS;   /*!< Tx multiple collision good packets register                Address offset: 0x0750 */
  __IO uint32_t TX_DEFERRED_PACKETS;                  /*!< Tx deferred packets register                               Address offset: 0x0754 */
  __IO uint32_t TX_LATE_COLLISION_PACKETS;            /*!< Tx late collision packets register                         Address offset: 0x0758 */
  __IO uint32_t TX_EXCESSIVE_COLLISION_PACKETS;       /*!< Tx excessive collision packets register                    Address offset: 0x075C */
  __IO uint32_t TX_CARRIER_ERROR_PACKETS;             /*!< Tx carrier error packets register                          Address offset: 0x0760 */
  __IO uint32_t TX_OCTET_COUNT_GOOD;                  /*!< Tx octet count good register                               Address offset: 0x0764 */
  __IO uint32_t TX_PACKET_COUNT_GOOD;                 /*!< Tx packet count good register                              Address offset: 0x0768 */
  __IO uint32_t TX_EXCESSIVE_DEFERRAL_ERROR;          /*!< Tx excessive deferral error register                       Address offset: 0x076C */
  __IO uint32_t TX_PAUSE_PACKETS;                     /*!< Tx pause packets register                                  Address offset: 0x0770 */
  __IO uint32_t TX_VLAN_PACKETS_GOOD;                 /*!< Tx VLAN packets good register                              Address offset: 0x0774 */
  __IO uint32_t TX_OSIZE_PACKETS_GOOD;                /*!< Tx OSsize packets good register                            Address offset: 0x0778 */
       uint32_t RESERVED17;                           /*!< Reserved                                                   Address offset: 0x077C */
  __IO uint32_t RX_PACKETS_COUNT_GOOD_BAD;            /*!< Rx packets count good bad register                         Address offset: 0x0780 */
  __IO uint32_t RX_OCTET_COUNT_GOOD_BAD;              /*!< Rx octet count good bad register                           Address offset: 0x0784 */
  __IO uint32_t RX_OCTET_COUNT_GOOD;                  /*!< Rx octet count good register                               Address offset: 0x0788 */
  __IO uint32_t RX_BROADCAST_PACKETS_GOOD;            /*!< Rx broadcast packets good register                         Address offset: 0x078C */
  __IO uint32_t RX_MULTICAST_PACKETS_GOOD;            /*!< Rx multicast packets good register                         Address offset: 0x0790 */
  __IO uint32_t RX_CRC_ERROR_PACKETS;                 /*!< Rx CRC error packets register                              Address offset: 0x0794 */
  __IO uint32_t RX_ALIGNMENT_ERROR_PACKETS;           /*!< Rx alignment error packets register                        Address offset: 0x0798 */
  __IO uint32_t RX_RUNT_ERROR_PACKETS;                /*!< Rx runt error packets register                             Address offset: 0x079C */
  __IO uint32_t RX_JABBER_ERROR_PACKETS;              /*!< Rx jabber error packets register                           Address offset: 0x07A0 */
  __IO uint32_t RX_UNDERSIZE_PACKETS_GOOD;            /*!< Rx undersize packets good register                         Address offset: 0x07A4 */
  __IO uint32_t RX_OVERSIZE_PACKETS_GOOD;             /*!< Rx oversize packets good register                          Address offset: 0x07A8 */
  __IO uint32_t RX_64OCTETS_PACKETS_GOOD_BAD;         /*!< Rx 64 octets packets good bad register                     Address offset: 0x07AC */
  __IO uint32_t RX_65TO127OCTETS_PACKETS_GOOD_BAD;    /*!< Rx 65 to 127 octets packets good bad register              Address offset: 0x07B0 */
  __IO uint32_t RX_128TO255OCTETS_PACKETS_GOOD_BAD;   /*!< Rx 128 to 255 octets packets good bad register             Address offset: 0x07B4 */
  __IO uint32_t RX_256TO511OCTETS_PACKETS_GOOD_BAD;   /*!< Rx 256 to 511 octets packets good bad register             Address offset: 0x07B8 */
  __IO uint32_t RX_512TO1023OCTETS_PACKETS_GOOD_BAD;  /*!< Rx 512 to 1023 octets packets good bad register            Address offset: 0x07BC */
  __IO uint32_t RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD;  /*!< Rx 1024 to max octets packets good bad register            Address offset: 0x07C0 */
  __IO uint32_t RX_UNICAST_PACKETS_GOOD;              /*!< Rx unicast packets good register                           Address offset: 0x07C4 */
  __IO uint32_t RX_LENGTH_ERROR_PACKETS;              /*!< Rx length error packets register                           Address offset: 0x07C8 */
  __IO uint32_t RX_OUT_OF_RANGE_PACKETS;              /*!< Rx out of range type packets register                      Address offset: 0x07CC */
  __IO uint32_t RX_PAUSE_PACKETS;                     /*!< Rx pause packets register                                  Address offset: 0x07D0 */
  __IO uint32_t RX_FIFO_OVERFLOW_PACKETS;             /*!< Rx FIFO overflow packets register                          Address offset: 0x07D4 */
  __IO uint32_t RX_VLAN_PACKETS_GOOD_BAD;             /*!< Rx VLAN packets good bad register                          Address offset: 0x07D8 */
  __IO uint32_t RX_WATCHDOG_ERROR_PACKETS;            /*!< Rx watchdog error packets register                         Address offset: 0x07DC */
  __IO uint32_t RX_RECEIVE_ERROR;                     /*!< Rx receive error register                                  Address offset: 0x07E0 */
  __IO uint32_t RX_CONTROL_PACKETS_GOOD;              /*!< Rx control packets good register                           Address offset: 0x07E4 */
       uint32_t RESERVED18;                           /*!< Reserved                                                   Address offset: 0x07E8 */
  __IO uint32_t TX_LPI_USEC_CNTR;                     /*!< Tx LPI microsecond timer register                          Address offset: 0x07EC */
  __IO uint32_t TX_LPI_TRAN_CNTR;                     /*!< Tx LPI transition counter register                         Address offset: 0x07F0 */
  __IO uint32_t RX_LPI_USEC_CNTR;                     /*!< Rx LPI microsecond counter register                        Address offset: 0x07F4 */
  __IO uint32_t RX_LPI_TRAN_CNTR;                     /*!< Rx LPI transition counter register                         Address offset: 0x07F8 */
       uint32_t RESERVED19[41];                       /*!< Reserved                                                   Address offset: 0x07FC-0x089C */
  __IO uint32_t MMC_FPE_TX_ISR;                       /*!< MMC FPE Tx interrupt status register                       Address offset: 0x08A0 */
  __IO uint32_t MMC_FPE_TX_IMR;                       /*!< MMC FPE Tx interrupt mask register                         Address offset: 0x08A4 */
  __IO uint32_t MMC_FPE_TX_FCR;                       /*!< MMC FPE Tx fragment counter register                       Address offset: 0x08A8 */
  __IO uint32_t MMC_TX_HRCR;                          /*!< MMC Tx hold request counter register                       Address offset: 0x08AC */
       uint32_t RESERVED20[4];                        /*!< Reserved                                                   Address offset: 0x08B0-0x08BC */
  __IO uint32_t MMC_FPE_RX_ISR;                       /*!< MMC FPE Rx interrupt status register                       Address offset: 0x08C0 */
  __IO uint32_t MMC_FPE_RX_IMR;                       /*!< MMC FPE Rx interrupt mask register                         Address offset: 0x08C4 */
  __IO uint32_t RX_PACKET_ASM_ERR;                    /*!< MMC Rx packet assembly error register                      Address offset: 0x08C8 */
  __IO uint32_t RX_PACKET_SMD_ERR;                    /*!< MMC Rx packet SMD error register                           Address offset: 0x08CC */
  __IO uint32_t RX_PACKET_ASM_OKR;                    /*!< MMC Rx packet assembly OK register                         Address offset: 0x08D0 */
  __IO uint32_t RX_FPE_FRAG_CR;                       /*!< MMC Rx FPE fragments counter register                      Address offset: 0x08D4 */
       uint32_t RESERVED21[10];                       /*!< Reserved                                                   Address offset: 0x08D8-0x08FC */
  __IO uint32_t MACL3L4C0R;                           /*!< L3 and L4 control 0 register                               Address offset: 0x0900 */
  __IO uint32_t MACL4A0R;                             /*!< Layer4 Address filter 0 register                           Address offset: 0x0904 */
       uint32_t RESERVED22[2];                        /*!< Reserved                                                   Address offset: 0x0908-0x090C */
  __IO uint32_t MACL3A00R;                            /*!< Layer3 Address 0 filter 0 register                         Address offset: 0x0910 */
  __IO uint32_t MACL3A10R;                            /*!< Layer3 Address 1 filter 0 register                         Address offset: 0x0914 */
  __IO uint32_t MACL3A20R;                            /*!< Layer3 Address 2 filter 0 register                         Address offset: 0x0918 */
  __IO uint32_t MACL3A30R;                            /*!< Layer3 Address 3 filter 0 register                         Address offset: 0x091C */
       uint32_t RESERVED23[4];                        /*!< Reserved                                                   Address offset: 0x0920-0x092C */
  __IO uint32_t MACL3L4C1R;                           /*!< L3 and L4 control 1 register                               Address offset: 0x0930 */
  __IO uint32_t MACL4A1R;                             /*!< Layer 4 address filter 1 register                          Address offset: 0x0934 */
       uint32_t RESERVED24[2];                        /*!< Reserved                                                   Address offset: 0x0938-0x093C */
  __IO uint32_t MACL3A01R;                            /*!< Layer3 address 0 filter 1 Register                         Address offset: 0x0940 */
  __IO uint32_t MACL3A11R;                            /*!< Layer3 address 1 filter 1 register                         Address offset: 0x0944 */
  __IO uint32_t MACL3A21R;                            /*!< Layer3 address 2 filter 1 Register                         Address offset: 0x0948 */
  __IO uint32_t MACL3A31R;                            /*!< Layer3 address 3 filter 1 register                         Address offset: 0x094C */
       uint32_t RESERVED25[72];                       /*!< Reserved                                                   Address offset: 0x0950-0x0A6C */
  __IO uint32_t MAC_IACR;                             /*!< MAC Indirect Access Control register                       Address offset: 0x0A70 */
  __IO uint32_t MAC_TMRQR;                            /*!< MAC type-based Rx Queue mapping register                   Address offset: 0x0A74 */
       uint32_t RESERVED26[34];                       /*!< Reserved                                                   Address offset: 0x0A78-0x0AFC */
  __IO uint32_t MACTSCR;                              /*!< Timestamp control Register                                 Address offset: 0x0B00 */
  __IO uint32_t MACSSIR;                              /*!< Subsecond increment register                               Address offset: 0x0B04 */
  __IO uint32_t MACSTSR;                              /*!< System time seconds register                               Address offset: 0x0B08 */
  __IO uint32_t MACSTNR;                              /*!< System time nanoseconds register                           Address offset: 0x0B0C */
  __IO uint32_t MACSTSUR;                             /*!< System time seconds update register                        Address offset: 0x0B10 */
