STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_cm33.h
/***************  Bit definition for DDRC_DFIMISC register  ****************/
#define DDRC_DFIMISC_DFI_INIT_COMPLETE_EN_Pos (0U)
#define DDRC_DFIMISC_DFI_INIT_COMPLETE_EN_Msk (0x1UL << DDRC_DFIMISC_DFI_INIT_COMPLETE_EN_Pos) /*!< 0x00000001 */
#define DDRC_DFIMISC_DFI_INIT_COMPLETE_EN     DDRC_DFIMISC_DFI_INIT_COMPLETE_EN_Msk           /*!< PHY initialization complete enable signal. */
#define DDRC_DFIMISC_DFI_INIT_START_Pos       (5U)
#define DDRC_DFIMISC_DFI_INIT_START_Msk       (0x1UL << DDRC_DFIMISC_DFI_INIT_START_Pos)       /*!< 0x00000020 */
#define DDRC_DFIMISC_DFI_INIT_START           DDRC_DFIMISC_DFI_INIT_START_Msk                 /*!< PHY init start request signal.When asserted it triggers the PHY init start request */
#define DDRC_DFIMISC_DFI_FREQUENCY_Pos        (8U)
#define DDRC_DFIMISC_DFI_FREQUENCY_Msk        (0x1FUL << DDRC_DFIMISC_DFI_FREQUENCY_Pos)       /*!< 0x00001F00 */
#define DDRC_DFIMISC_DFI_FREQUENCY            DDRC_DFIMISC_DFI_FREQUENCY_Msk                  /*!< PHY system operating frequency */

/***************  Bit definition for DDRC_DFISTAT register  ****************/
#define DDRC_DFISTAT_DFI_INIT_COMPLETE_Pos (0U)
#define DDRC_DFISTAT_DFI_INIT_COMPLETE_Msk (0x1UL << DDRC_DFISTAT_DFI_INIT_COMPLETE_Pos) /*!< 0x00000001 */
#define DDRC_DFISTAT_DFI_INIT_COMPLETE     DDRC_DFISTAT_DFI_INIT_COMPLETE_Msk           /*!< The status flag register which announces when the DFI initialization has been completed. The DFI INIT triggered by dfi_init_start signal and then the dfi_init_complete flag is polled to know when the initialization is done. */
#define DDRC_DFISTAT_DFI_LP_ACK_Pos        (1U)
#define DDRC_DFISTAT_DFI_LP_ACK_Msk        (0x1UL << DDRC_DFISTAT_DFI_LP_ACK_Pos)        /*!< 0x00000002 */
#define DDRC_DFISTAT_DFI_LP_ACK            DDRC_DFISTAT_DFI_LP_ACK_Msk                  /*!< Stores the value of dfi_lp_ack input to the controller. */

/*****************  Bit definition for DDRC_DBG1 register  *****************/
#define DDRC_DBG1_DIS_DQ_Pos  (0U)
#define DDRC_DBG1_DIS_DQ_Msk  (0x1UL << DDRC_DBG1_DIS_DQ_Pos)  /*!< 0x00000001 */
#define DDRC_DBG1_DIS_DQ      DDRC_DBG1_DIS_DQ_Msk            /*!< When 1, DDRC does not dequeue any transactions from the CAM. Bypass is also disabled. All transactions are queued in the CAM. No reads or writes are issued to SDRAM as long as this bit is asserted. */
#define DDRC_DBG1_DIS_HIF_Pos (1U)
#define DDRC_DBG1_DIS_HIF_Msk (0x1UL << DDRC_DBG1_DIS_HIF_Pos) /*!< 0x00000002 */
#define DDRC_DBG1_DIS_HIF     DDRC_DBG1_DIS_HIF_Msk           /*!< When 1, DDRC asserts the HIF command signal hif_cmd_stall. DDRC ignores the hif_cmd_valid and all other associated request signals. */

/****************  Bit definition for DDRC_DBGCAM register  ****************/
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos        (0U)
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Msk        (0x1FUL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)       /*!< 0x0000001F */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH            DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Msk                  /*!< High priority read queue depth */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_0          (0x1UL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000001 */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_1          (0x2UL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000002 */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_2          (0x4UL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000004 */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_3          (0x8UL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000008 */
#define DDRC_DBGCAM_DBG_HPR_Q_DEPTH_4          (0x10UL << DDRC_DBGCAM_DBG_HPR_Q_DEPTH_Pos)       /*!< 0x00000010 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos        (8U)
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Msk        (0x1FUL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)       /*!< 0x00001F00 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH            DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Msk                  /*!< Low priority read queue depth */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_0          (0x1UL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000100 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_1          (0x2UL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000200 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_2          (0x4UL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000400 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_3          (0x8UL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000800 */
#define DDRC_DBGCAM_DBG_LPR_Q_DEPTH_4          (0x10UL << DDRC_DBGCAM_DBG_LPR_Q_DEPTH_Pos)       /*!< 0x00001000 */
#define DDRC_DBGCAM_DBG_RD_Q_EMPTY_Pos         (25U)
#define DDRC_DBGCAM_DBG_RD_Q_EMPTY_Msk         (0x1UL << DDRC_DBGCAM_DBG_RD_Q_EMPTY_Pos)         /*!< 0x02000000 */
#define DDRC_DBGCAM_DBG_RD_Q_EMPTY             DDRC_DBGCAM_DBG_RD_Q_EMPTY_Msk                   /*!< When 1, all the Read command queues and Read data buffers inside DDRC are empty. This register is to be used for debug purpose. */
#define DDRC_DBGCAM_DBG_WR_Q_EMPTY_Pos         (26U)
#define DDRC_DBGCAM_DBG_WR_Q_EMPTY_Msk         (0x1UL << DDRC_DBGCAM_DBG_WR_Q_EMPTY_Pos)         /*!< 0x04000000 */
#define DDRC_DBGCAM_DBG_WR_Q_EMPTY             DDRC_DBGCAM_DBG_WR_Q_EMPTY_Msk                   /*!< When 1, all the Write command queues and Write data buffers inside DDRC are empty. This register is to be used for debug purpose. */
#define DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY_Pos (28U)
#define DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY_Msk (0x1UL << DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY_Pos) /*!< 0x10000000 */
#define DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY     DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY_Msk           /*!< This bit indicates that the read data pipeline on the DFI interface is empty. This register is intended to be polled at least twice after setting DBG1.dis_dq, to ensure that all remaining commands/data have completed. */
#define DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY_Pos (29U)
#define DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY_Msk (0x1UL << DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY_Pos) /*!< 0x20000000 */
#define DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY     DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY_Msk           /*!< This bit indicates that the write data pipeline on the DFI interface is empty. This register is intended to be polled at least twice after setting DBG1.dis_dq, to ensure that all remaining commands/data have completed. */

/****************  Bit definition for DDRC_DBGCMD register  ****************/
#define DDRC_DBGCMD_RANK0_REFRESH_Pos  (0U)
#define DDRC_DBGCMD_RANK0_REFRESH_Msk  (0x1UL << DDRC_DBGCMD_RANK0_REFRESH_Pos)  /*!< 0x00000001 */
#define DDRC_DBGCMD_RANK0_REFRESH      DDRC_DBGCMD_RANK0_REFRESH_Msk            /*!< Setting this register bit to 1 indicates to the DDRC to issue a refresh to rank 0. Writing to this bit causes DBGSTAT.rank0_refresh_busy to be set. When DBGSTAT.rank0_refresh_busy is cleared, the command has been stored in DDRC. */

/***************  Bit definition for DDRC_DBGSTAT register  ****************/
#define DDRC_DBGSTAT_RANK0_REFRESH_BUSY_Pos  (0U)
#define DDRC_DBGSTAT_RANK0_REFRESH_BUSY_Msk  (0x1UL << DDRC_DBGSTAT_RANK0_REFRESH_BUSY_Pos)  /*!< 0x00000001 */
#define DDRC_DBGSTAT_RANK0_REFRESH_BUSY      DDRC_DBGSTAT_RANK0_REFRESH_BUSY_Msk            /*!< SoC core may initiate a rank0_refresh operation (refresh operation to rank 0) only if this signal is low. This signal goes high in the clock after DBGCMD.rank0_refresh is set to one. It goes low when the rank0_refresh operation is stored in the DDRC. It is recommended not to perform rank0_refresh operations when this signal is high. */

/****************  Bit definition for DDRC_SWCTL register  *****************/
#define DDRC_SWCTL_SW_DONE_Pos (0U)
#define DDRC_SWCTL_SW_DONE_Msk (0x1UL << DDRC_SWCTL_SW_DONE_Pos) /*!< 0x00000001 */
#define DDRC_SWCTL_SW_DONE     DDRC_SWCTL_SW_DONE_Msk           /*!< Enable quasi-dynamic register programming outside reset. Program register to 0 to enable quasi-dynamic programming. Set back register to 1 once programming is done. */

/****************  Bit definition for DDRC_SWSTAT register  ****************/
#define DDRC_SWSTAT_SW_DONE_ACK_Pos (0U)
#define DDRC_SWSTAT_SW_DONE_ACK_Msk (0x1UL << DDRC_SWSTAT_SW_DONE_ACK_Pos) /*!< 0x00000001 */
#define DDRC_SWSTAT_SW_DONE_ACK     DDRC_SWSTAT_SW_DONE_ACK_Msk           /*!< Register programming done. This register is the echo of SWCTL.sw_done. Wait for sw_done value 1 to propagate to sw_done_ack at the end of the programming sequence to ensure that the correct registers values are propagated to the destination clock domains. */

/***************  Bit definition for DDRC_PCTRL_0 register  ****************/
#define DDRC_PCTRL_0_PORT_EN_Pos (0U)
#define DDRC_PCTRL_0_PORT_EN_Msk (0x1UL << DDRC_PCTRL_0_PORT_EN_Pos) /*!< 0x00000001 */
#define DDRC_PCTRL_0_PORT_EN     DDRC_PCTRL_0_PORT_EN_Msk           /*!< Enables AXI port n. */

/***************  Bit definition for DDRC_PCTRL_1 register  ****************/
#define DDRC_PCTRL_1_PORT_EN_Pos (0U)
#define DDRC_PCTRL_1_PORT_EN_Msk (0x1UL << DDRC_PCTRL_1_PORT_EN_Pos) /*!< 0x00000001 */
#define DDRC_PCTRL_1_PORT_EN     DDRC_PCTRL_1_PORT_EN_Msk           /*!< Enables AXI port n. */

/******************************************************************************/
/*                                                                            */
/*                             DDRDBG (DDRSS sysconf)                         */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for DDRDBG_LP_DISABLE  ********************/
#define DDRDBG_LP_DISABLE_LPI_XPI_DISABLE_Pos  (0U)
#define DDRDBG_LP_DISABLE_LPI_XPI_DISABLE_Msk  (0x1UL << DDRDBG_LP_DISABLE_LPI_XPI_DISABLE_Pos)  /*!< 0x00000001 */
#define DDRDBG_LP_DISABLE_LPI_XPI_DISABLE      DDRDBG_LP_DISABLE_LPI_XPI_DISABLE_Msk            /*!< Disables the possibility to automatically (out of RCC control) gate down the DDRC clock when an inactivity period is detected. */
#define DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE_Pos (8U)
#define DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE_Msk (0x1UL << DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE_Pos) /*!< 0x00000100 */
#define DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE     DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE_Msk           /*!< Disables the possibility to automatically (out of RCC control) gate down the XPI port axi_clock when an inactivity period is detected. */

