STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_cm33.h
/* Bit fields for RCC_FINDIVSR2 register */
#define RCC_FINDIVSR2_FINDIVSTS_Pos                  (0U)
#define RCC_FINDIVSR2_FINDIVSTS_Msk                  (0xFFFFFFFFUL << RCC_FINDIVSR2_FINDIVSTS_Pos)
#define RCC_FINDIVSR2_FINDIVSTS                      RCC_FINDIVSR2_FINDIVSTS_Msk

/* Bit fields for RCC_FCALCOBS0CFGR register */
#define RCC_FCALCOBS0CFGR_CKINTSEL_Pos               (0U)
#define RCC_FCALCOBS0CFGR_CKINTSEL_Msk               (0xffUL  << RCC_FCALCOBS0CFGR_CKINTSEL_Pos)
#define RCC_FCALCOBS0CFGR_CKINTSEL                   RCC_FCALCOBS0CFGR_CKINTSEL_Msk
#define RCC_FCALCOBS0CFGR_CKEXTSEL_Pos               (8U)
#define RCC_FCALCOBS0CFGR_CKEXTSEL_Msk               (0x7UL  << RCC_FCALCOBS0CFGR_CKEXTSEL_Pos)
#define RCC_FCALCOBS0CFGR_CKEXTSEL                   RCC_FCALCOBS0CFGR_CKEXTSEL_Msk
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Pos          (15U)
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Msk          (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Pos)
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL              RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Msk
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Pos            (16U)
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Msk            (0x1UL << RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Pos)
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL                RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Msk
#define RCC_FCALCOBS0CFGR_FCALCCKINV_Pos             (17U)
#define RCC_FCALCOBS0CFGR_FCALCCKINV_Msk             (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKINV_Pos)
#define RCC_FCALCOBS0CFGR_FCALCCKINV                 RCC_FCALCOBS0CFGR_FCALCCKINV_Msk
#define RCC_FCALCOBS0CFGR_CKOBSINV_Pos               (18U)
#define RCC_FCALCOBS0CFGR_CKOBSINV_Msk               (0x1UL << RCC_FCALCOBS0CFGR_CKOBSINV_Pos)
#define RCC_FCALCOBS0CFGR_CKOBSINV                   RCC_FCALCOBS0CFGR_CKOBSINV_Msk
#define RCC_FCALCOBS0CFGR_CKOBSDIV_Pos               (22U)
#define RCC_FCALCOBS0CFGR_CKOBSDIV_Msk               (0x7UL  << RCC_FCALCOBS0CFGR_CKOBSDIV_Pos)
#define RCC_FCALCOBS0CFGR_CKOBSDIV                   RCC_FCALCOBS0CFGR_CKOBSDIV_Msk
#define RCC_FCALCOBS0CFGR_FCALCCKEN_Pos              (25U)
#define RCC_FCALCOBS0CFGR_FCALCCKEN_Msk              (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKEN_Pos)
#define RCC_FCALCOBS0CFGR_FCALCCKEN                  RCC_FCALCOBS0CFGR_FCALCCKEN_Msk
#define RCC_FCALCOBS0CFGR_CKOBSEN_Pos                (26U)
#define RCC_FCALCOBS0CFGR_CKOBSEN_Msk                (0x1UL << RCC_FCALCOBS0CFGR_CKOBSEN_Pos)
#define RCC_FCALCOBS0CFGR_CKOBSEN                    RCC_FCALCOBS0CFGR_CKOBSEN_Msk

/* Bit fields for RCC_FCALCOBS1CFGR register */
#define RCC_FCALCOBS1CFGR_CKINTSEL_Pos               (0U)
#define RCC_FCALCOBS1CFGR_CKINTSEL_Msk               (0xffUL  << RCC_FCALCOBS1CFGR_CKINTSEL_Pos)
#define RCC_FCALCOBS1CFGR_CKINTSEL                   RCC_FCALCOBS1CFGR_CKINTSEL_Msk
#define RCC_FCALCOBS1CFGR_CKEXTSEL_Pos               (8U)
#define RCC_FCALCOBS1CFGR_CKEXTSEL_Msk               (0x7UL  << RCC_FCALCOBS1CFGR_CKEXTSEL_Pos)
#define RCC_FCALCOBS1CFGR_CKEXTSEL                   RCC_FCALCOBS1CFGR_CKEXTSEL_Msk
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Pos            (16U)
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Msk            (0x1UL << RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Pos)
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL                RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Msk
#define RCC_FCALCOBS1CFGR_CKOBSINV_Pos               (18U)
#define RCC_FCALCOBS1CFGR_CKOBSINV_Msk               (0x1UL << RCC_FCALCOBS1CFGR_CKOBSINV_Pos)
#define RCC_FCALCOBS1CFGR_CKOBSINV                   RCC_FCALCOBS1CFGR_CKOBSINV_Msk
#define RCC_FCALCOBS1CFGR_CKOBSDIV_Pos               (22U)
#define RCC_FCALCOBS1CFGR_CKOBSDIV_Msk               (0x7UL  << RCC_FCALCOBS1CFGR_CKOBSDIV_Pos)
#define RCC_FCALCOBS1CFGR_CKOBSDIV                   RCC_FCALCOBS1CFGR_CKOBSDIV_Msk
#define RCC_FCALCOBS1CFGR_CKOBSEN_Pos                (26U)
#define RCC_FCALCOBS1CFGR_CKOBSEN_Msk                (0x1UL << RCC_FCALCOBS1CFGR_CKOBSEN_Pos)
#define RCC_FCALCOBS1CFGR_CKOBSEN                    RCC_FCALCOBS1CFGR_CKOBSEN_Msk
#define RCC_FCALCOBS1CFGR_FCALCRSTN_Pos              (27U)
#define RCC_FCALCOBS1CFGR_FCALCRSTN_Msk              (0x1UL << RCC_FCALCOBS1CFGR_FCALCRSTN_Pos)
#define RCC_FCALCOBS1CFGR_FCALCRSTN                  RCC_FCALCOBS1CFGR_FCALCRSTN_Msk

/* Bit fields for RCC_FCALCREFCFGR register */
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_Pos           (0U)
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_Msk           (0x7UL  << RCC_FCALCREFCFGR_FCALCREFCKSEL_Pos)
#define RCC_FCALCREFCFGR_FCALCREFCKSEL               RCC_FCALCREFCFGR_FCALCREFCKSEL_Msk

/* Bit fields for RCC_FCALCCR1 register */
#define RCC_FCALCCR1_FCALCRUN_Pos                    (0U)
#define RCC_FCALCCR1_FCALCRUN_Msk                    (0x1UL << RCC_FCALCCR1_FCALCRUN_Pos)
#define RCC_FCALCCR1_FCALCRUN                        RCC_FCALCCR1_FCALCRUN_Msk

/* Bit fields for RCC_FCALCCR2 register */
#define RCC_FCALCCR2_FCALCMD_Pos                     (3U)
#define RCC_FCALCCR2_FCALCMD_Msk                     (0x3UL << RCC_FCALCCR2_FCALCMD_Pos)
#define RCC_FCALCCR2_FCALCMD                         RCC_FCALCCR2_FCALCMD_Msk
#define RCC_FCALCCR2_FCALCTWC_Pos                    (11U)
#define RCC_FCALCCR2_FCALCTWC_Msk                    (0xfUL  << RCC_FCALCCR2_FCALCTWC_Pos)
#define RCC_FCALCCR2_FCALCTWC                        RCC_FCALCCR2_FCALCTWC_Msk
#define RCC_FCALCCR2_FCALCTYP_Pos                    (17U)
#define RCC_FCALCCR2_FCALCTYP_Msk                    (0x1fUL  << RCC_FCALCCR2_FCALCTYP_Pos)
#define RCC_FCALCCR2_FCALCTYP                        RCC_FCALCCR2_FCALCTYP_Msk

/* Bit fields for RCC_FCALCSR register */
#define RCC_FCALCSR_FVAL_Pos                         (0U)
#define RCC_FCALCSR_FVAL_Msk                         (0x1ffffUL << RCC_FCALCSR_FVAL_Pos)
#define RCC_FCALCSR_FVAL                             RCC_FCALCSR_FVAL_Msk
#define RCC_FCALCSR_FCALCSTS_Pos                     (19U)
#define RCC_FCALCSR_FCALCSTS_Msk                     (0x1UL << RCC_FCALCSR_FCALCSTS_Pos)
#define RCC_FCALCSR_FCALCSTS                         RCC_FCALCSR_FCALCSTS_Msk

/* Bit fields for RCC_PLL4CFGR1 register */
#define RCC_PLL4CFGR1_SSMODRST_Pos                   (0U)
#define RCC_PLL4CFGR1_SSMODRST_Msk                   (0x1UL << RCC_PLL4CFGR1_SSMODRST_Pos)
#define RCC_PLL4CFGR1_SSMODRST                       RCC_PLL4CFGR1_SSMODRST_Msk
#define RCC_PLL4CFGR1_PLLEN_Pos                      (8U)
#define RCC_PLL4CFGR1_PLLEN_Msk                      (0x1UL << RCC_PLL4CFGR1_PLLEN_Pos)
#define RCC_PLL4CFGR1_PLLEN                          RCC_PLL4CFGR1_PLLEN_Msk
#define RCC_PLL4CFGR1_PLLRDY_Pos                     (24U)
#define RCC_PLL4CFGR1_PLLRDY_Msk                     (0x1UL << RCC_PLL4CFGR1_PLLRDY_Pos)
#define RCC_PLL4CFGR1_PLLRDY                         RCC_PLL4CFGR1_PLLRDY_Msk
#define RCC_PLL4CFGR1_CKREFST_Pos                    (28U)
#define RCC_PLL4CFGR1_CKREFST_Msk                    (0x1UL << RCC_PLL4CFGR1_CKREFST_Pos)
#define RCC_PLL4CFGR1_CKREFST                        RCC_PLL4CFGR1_CKREFST_Msk

/* Bit fields for RCC_PLL4CFGR2 register */
#define RCC_PLL4CFGR2_FREFDIV_Pos                    (0U)
#define RCC_PLL4CFGR2_FREFDIV_Msk                    (0x3fUL  << RCC_PLL4CFGR2_FREFDIV_Pos)
#define RCC_PLL4CFGR2_FREFDIV                        RCC_PLL4CFGR2_FREFDIV_Msk
#define RCC_PLL4CFGR2_FBDIV_Pos                      (16U)
#define RCC_PLL4CFGR2_FBDIV_Msk                      (0xfffUL  << RCC_PLL4CFGR2_FBDIV_Pos)
#define RCC_PLL4CFGR2_FBDIV                          RCC_PLL4CFGR2_FBDIV_Msk

/* Bit fields for RCC_PLL4CFGR3 register */
#define RCC_PLL4CFGR3_FRACIN_Pos                     (0U)
#define RCC_PLL4CFGR3_FRACIN_Msk                     (0xffffffUL  << RCC_PLL4CFGR3_FRACIN_Pos)
#define RCC_PLL4CFGR3_FRACIN                         RCC_PLL4CFGR3_FRACIN_Msk
#define RCC_PLL4CFGR3_DOWNSPREAD_Pos                 (24U)
#define RCC_PLL4CFGR3_DOWNSPREAD_Msk                 (0x1UL << RCC_PLL4CFGR3_DOWNSPREAD_Pos)
#define RCC_PLL4CFGR3_DOWNSPREAD                     RCC_PLL4CFGR3_DOWNSPREAD_Msk
#define RCC_PLL4CFGR3_DACEN_Pos                      (25U)
#define RCC_PLL4CFGR3_DACEN_Msk                      (0x1UL << RCC_PLL4CFGR3_DACEN_Pos)
#define RCC_PLL4CFGR3_DACEN                          RCC_PLL4CFGR3_DACEN_Msk
#define RCC_PLL4CFGR3_SSCGDIS_Pos                    (26U)
#define RCC_PLL4CFGR3_SSCGDIS_Msk                    (0x1UL << RCC_PLL4CFGR3_SSCGDIS_Pos)
#define RCC_PLL4CFGR3_SSCGDIS                        RCC_PLL4CFGR3_SSCGDIS_Msk

/* Bit fields for RCC_PLL4CFGR4 register */
#define RCC_PLL4CFGR4_DSMEN_Pos                      (8U)
#define RCC_PLL4CFGR4_DSMEN_Msk                      (0x1UL << RCC_PLL4CFGR4_DSMEN_Pos)
#define RCC_PLL4CFGR4_DSMEN                          RCC_PLL4CFGR4_DSMEN_Msk
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN_Pos              (9U)
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN_Msk              (0x1UL << RCC_PLL4CFGR4_FOUTPOSTDIVEN_Pos)
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN                  RCC_PLL4CFGR4_FOUTPOSTDIVEN_Msk
#define RCC_PLL4CFGR4_BYPASS_Pos                     (10U)
#define RCC_PLL4CFGR4_BYPASS_Msk                     (0x1UL << RCC_PLL4CFGR4_BYPASS_Pos)
#define RCC_PLL4CFGR4_BYPASS                         RCC_PLL4CFGR4_BYPASS_Msk

/* Bit fields for RCC_PLL4CFGR5 register */
#define RCC_PLL4CFGR5_DIVVAL_Pos                     (0U)
#define RCC_PLL4CFGR5_DIVVAL_Msk                     (0xfUL  << RCC_PLL4CFGR5_DIVVAL_Pos)
#define RCC_PLL4CFGR5_DIVVAL                         RCC_PLL4CFGR5_DIVVAL_Msk
#define RCC_PLL4CFGR5_SPREAD_Pos                     (16U)
#define RCC_PLL4CFGR5_SPREAD_Msk                     (0x1fUL  << RCC_PLL4CFGR5_SPREAD_Pos)
#define RCC_PLL4CFGR5_SPREAD                         RCC_PLL4CFGR5_SPREAD_Msk

/* Bit fields for RCC_PLL4CFGR6 register */
#define RCC_PLL4CFGR6_POSTDIV1_Pos                   (0U)
#define RCC_PLL4CFGR6_POSTDIV1_Msk                   (0x7UL  << RCC_PLL4CFGR6_POSTDIV1_Pos)
#define RCC_PLL4CFGR6_POSTDIV1                       RCC_PLL4CFGR6_POSTDIV1_Msk

