STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_cm33.h
/******************  Bit definition for SERC_ISR2 register  *******************/
#define SERC_ISR2_PDRS64_Pos         (0U)
#define SERC_ISR2_PDRS64_Msk         (0x1UL << SERC_ISR2_PDRS64_Pos)    /*!< 0x00000001 */
#define SERC_ISR2_PDRS64             SERC_ISR2_PDRS64_Msk
#define SERC_ISR2_PDRS65_Pos         (1U)
#define SERC_ISR2_PDRS65_Msk         (0x1UL << SERC_ISR2_PDRS65_Pos)    /*!< 0x00000002 */
#define SERC_ISR2_PDRS65             SERC_ISR2_PDRS65_Msk
#define SERC_ISR2_PDRS66_Pos         (2U)
#define SERC_ISR2_PDRS66_Msk         (0x1UL << SERC_ISR2_PDRS66_Pos)    /*!< 0x00000004 */
#define SERC_ISR2_PDRS66             SERC_ISR2_PDRS66_Msk
#define SERC_ISR2_PDRS67_Pos         (3U)
#define SERC_ISR2_PDRS67_Msk         (0x1UL << SERC_ISR2_PDRS67_Pos)    /*!< 0x00000008 */
#define SERC_ISR2_PDRS67             SERC_ISR2_PDRS67_Msk
#define SERC_ISR2_PDRS68_Pos         (4U)
#define SERC_ISR2_PDRS68_Msk         (0x1UL << SERC_ISR2_PDRS68_Pos)    /*!< 0x00000010 */
#define SERC_ISR2_PDRS68             SERC_ISR2_PDRS68_Msk
#define SERC_ISR2_PDRS69_Pos         (5U)
#define SERC_ISR2_PDRS69_Msk         (0x1UL << SERC_ISR2_PDRS69_Pos)    /*!< 0x00000020 */
#define SERC_ISR2_PDRS69             SERC_ISR2_PDRS69_Msk
#define SERC_ISR2_PDRS70_Pos         (6U)
#define SERC_ISR2_PDRS70_Msk         (0x1UL << SERC_ISR2_PDRS70_Pos)    /*!< 0x00000040 */
#define SERC_ISR2_PDRS70             SERC_ISR2_PDRS70_Msk
#define SERC_ISR2_PDRS71_Pos         (7U)
#define SERC_ISR2_PDRS71_Msk         (0x1UL << SERC_ISR2_PDRS71_Pos)    /*!< 0x00000080 */
#define SERC_ISR2_PDRS71             SERC_ISR2_PDRS71_Msk
#define SERC_ISR2_PDRS72_Pos         (8U)
#define SERC_ISR2_PDRS72_Msk         (0x1UL << SERC_ISR2_PDRS72_Pos)    /*!< 0x00000100 */
#define SERC_ISR2_PDRS72             SERC_ISR2_PDRS72_Msk
#define SERC_ISR2_PDRS73_Pos         (9U)
#define SERC_ISR2_PDRS73_Msk         (0x1UL << SERC_ISR2_PDRS73_Pos)    /*!< 0x00000200 */
#define SERC_ISR2_PDRS73             SERC_ISR2_PDRS73_Msk
#define SERC_ISR2_PDRS74_Pos         (10U)
#define SERC_ISR2_PDRS74_Msk         (0x1UL << SERC_ISR2_PDRS74_Pos)    /*!< 0x00000400 */
#define SERC_ISR2_PDRS74             SERC_ISR2_PDRS74_Msk
#define SERC_ISR2_PDRS75_Pos         (11U)
#define SERC_ISR2_PDRS75_Msk         (0x1UL << SERC_ISR2_PDRS75_Pos)    /*!< 0x00000800 */
#define SERC_ISR2_PDRS75             SERC_ISR2_PDRS75_Msk
#define SERC_ISR2_PDRS76_Pos         (12U)
#define SERC_ISR2_PDRS76_Msk         (0x1UL << SERC_ISR2_PDRS76_Pos)    /*!< 0x00001000 */
#define SERC_ISR2_PDRS76             SERC_ISR2_PDRS76_Msk
#define SERC_ISR2_PDRS77_Pos         (13U)
#define SERC_ISR2_PDRS77_Msk         (0x1UL << SERC_ISR2_PDRS77_Pos)    /*!< 0x00002000 */
#define SERC_ISR2_PDRS77             SERC_ISR2_PDRS77_Msk
#define SERC_ISR2_PDRS78_Pos         (14U)
#define SERC_ISR2_PDRS78_Msk         (0x1UL << SERC_ISR2_PDRS78_Pos)    /*!< 0x00004000 */
#define SERC_ISR2_PDRS78             SERC_ISR2_PDRS78_Msk
#define SERC_ISR2_PDRS79_Pos         (15U)
#define SERC_ISR2_PDRS79_Msk         (0x1UL << SERC_ISR2_PDRS79_Pos)    /*!< 0x00008000 */
#define SERC_ISR2_PDRS79             SERC_ISR2_PDRS79_Msk
#define SERC_ISR2_PDRS80_Pos         (16U)
#define SERC_ISR2_PDRS80_Msk         (0x1UL << SERC_ISR2_PDRS80_Pos)    /*!< 0x00010000 */
#define SERC_ISR2_PDRS80             SERC_ISR2_PDRS80_Msk
#define SERC_ISR2_PDRS81_Pos         (17U)
#define SERC_ISR2_PDRS81_Msk         (0x1UL << SERC_ISR2_PDRS81_Pos)    /*!< 0x00020000 */
#define SERC_ISR2_PDRS81             SERC_ISR2_PDRS81_Msk
#define SERC_ISR2_PDRS82_Pos         (18U)
#define SERC_ISR2_PDRS82_Msk         (0x1UL << SERC_ISR2_PDRS82_Pos)    /*!< 0x00040000 */
#define SERC_ISR2_PDRS82             SERC_ISR2_PDRS82_Msk
#define SERC_ISR2_PDRS83_Pos         (19U)
#define SERC_ISR2_PDRS83_Msk         (0x1UL << SERC_ISR2_PDRS83_Pos)    /*!< 0x00080000 */
#define SERC_ISR2_PDRS83             SERC_ISR2_PDRS83_Msk
#define SERC_ISR2_PDRS84_Pos         (20U)
#define SERC_ISR2_PDRS84_Msk         (0x1UL << SERC_ISR2_PDRS84_Pos)    /*!< 0x00100000 */
#define SERC_ISR2_PDRS84             SERC_ISR2_PDRS84_Msk
#define SERC_ISR2_PDRS85_Pos         (21U)
#define SERC_ISR2_PDRS85_Msk         (0x1UL << SERC_ISR2_PDRS85_Pos)    /*!< 0x00200000 */
#define SERC_ISR2_PDRS85             SERC_ISR2_PDRS85_Msk
#define SERC_ISR2_PDRS86_Pos         (22U)
#define SERC_ISR2_PDRS86_Msk         (0x1UL << SERC_ISR2_PDRS86_Pos)    /*!< 0x00400000 */
#define SERC_ISR2_PDRS86             SERC_ISR2_PDRS86_Msk
#define SERC_ISR2_PDRS87_Pos         (23U)
#define SERC_ISR2_PDRS87_Msk         (0x1UL << SERC_ISR2_PDRS87_Pos)    /*!< 0x00800000 */
#define SERC_ISR2_PDRS87             SERC_ISR2_PDRS87_Msk
#define SERC_ISR2_PDRS88_Pos         (24U)
#define SERC_ISR2_PDRS88_Msk         (0x1UL << SERC_ISR2_PDRS88_Pos)    /*!< 0x01000000 */
#define SERC_ISR2_PDRS88             SERC_ISR2_PDRS88_Msk
#define SERC_ISR2_PDRS89_Pos         (25U)
#define SERC_ISR2_PDRS89_Msk         (0x1UL << SERC_ISR2_PDRS89_Pos)    /*!< 0x02000000 */
#define SERC_ISR2_PDRS89             SERC_ISR2_PDRS89_Msk
#define SERC_ISR2_PDRS90_Pos         (26U)
#define SERC_ISR2_PDRS90_Msk         (0x1UL << SERC_ISR2_PDRS90_Pos)    /*!< 0x04000000 */
#define SERC_ISR2_PDRS90             SERC_ISR2_PDRS90_Msk
#define SERC_ISR2_PDRS91_Pos         (27U)
#define SERC_ISR2_PDRS91_Msk         (0x1UL << SERC_ISR2_PDRS91_Pos)    /*!< 0x08000000 */
#define SERC_ISR2_PDRS91             SERC_ISR2_PDRS91_Msk
#define SERC_ISR2_PDRS92_Pos         (28U)
#define SERC_ISR2_PDRS92_Msk         (0x1UL << SERC_ISR2_PDRS92_Pos)    /*!< 0x10000000 */
#define SERC_ISR2_PDRS92             SERC_ISR2_PDRS92_Msk
#define SERC_ISR2_PDRS93_Pos         (29U)
#define SERC_ISR2_PDRS93_Msk         (0x1UL << SERC_ISR2_PDRS93_Pos)    /*!< 0x20000000 */
#define SERC_ISR2_PDRS93             SERC_ISR2_PDRS93_Msk
#define SERC_ISR2_PDRS94_Pos         (30U)
#define SERC_ISR2_PDRS94_Msk         (0x1UL << SERC_ISR2_PDRS94_Pos)    /*!< 0x40000000 */
#define SERC_ISR2_PDRS94             SERC_ISR2_PDRS94_Msk
#define SERC_ISR2_PDRS95_Pos         (31U)
#define SERC_ISR2_PDRS95_Msk         (0x1UL << SERC_ISR2_PDRS95_Pos)    /*!< 0x80000000 */
#define SERC_ISR2_PDRS95             SERC_ISR2_PDRS95_Msk

